app/Controllers/AdminAuth.php

SELECT *
FROM `admins`
WHERE `email` = 'mdshafikansari548@gmail.com'
OR `username` = 'mdshafikansari548@gmail.com'
 LIMIT 1
UPDATE `admins` SET `reset_token` = 'a0962e3c1baf199c3bc4a4cfb2e9c69f95b410b24db56ae23f8fe650d3c85ad14894b5af5c2618c14b53f522b5e8c696b54d', `token_expiry` = '2026-04-01 16:09:58', `updated_at` = '2026-04-01 15:09:58'
WHERE `admins`.`id` IN ('1')
---
    public function sendResetLink()
{
    $input = $this->request->getPost('email'); // ya username
    $model = new \App\Models\AdminModel();

    $admin = $model->where('email', $input)
                   ->orWhere('username', $input)
                   ->first();

    if (!$admin) {
        return redirect()->back()->with('error', 'Admin not found');
    }

     if (empty($admin['email'])) {
        return redirect()->back()->with('error', 'Email not set for admin');
    }

    $token = bin2hex(random_bytes(50));
    $expiry = date('Y-m-d H:i:s', strtotime('+1 hour'));

    $model->update($admin['id'], [
        'reset_token' => $token,
        'token_expiry' => $expiry
    ]);

SELECT *
FROM `admins`
WHERE `reset_token` = 'a0962e3c1baf199c3bc4a4cfb2e9c69f95b410b24db56ae23f8fe650d3c85ad14894b5af5c2618c14b53f522b5e8c696b54d'
 LIMIT 1
---
public function resetPassword($token)
{
    $model = new \App\Models\AdminModel();

    $admin = $model->where('reset_token', $token)->first();

SELECT *
FROM `admins`
WHERE `reset_token` = 'f76fe49c63d9ea1fd2efb4abb8b71828e42c2b758ff224662d78db5e2545884a1ece3bf1e7a67c43c48f68d876d214f170ee'
 LIMIT 1
UPDATE `admins` SET `password` = '$2y$10$FgfGW.Xxc5vuOrQAOj1VsuFyKaJ49Q8lwZEgy0NditMUFARXCmaRG', `reset_token` = NULL, `token_expiry` = NULL, `updated_at` = '2026-04-01 15:21:48'
WHERE `admins`.`id` IN ('2')
---
public function updatePassword()
{
    $token = $this->request->getPost('token');
    $password = $this->request->getPost('password');

    $model = new \App\Models\AdminModel();

    $admin = $model->where('reset_token', $token)->first();

    if (!$admin) {
        return "Invalid token";
    }

    $hashed = password_hash($password, PASSWORD_DEFAULT);

    $model->update($admin['id'], [
        'password' => $hashed,
        'reset_token' => null,
        'token_expiry' => null
    ]);