app/Controllers/Co_curricular.php

SELECT *
FROM `co_curricular`
ORDER BY `id` DESC
---
    public function index(): string
    {
        $model = new CoCurricularModel();
        $data['media'] = $model->orderBy('id', 'DESC')->findAll();