app/Controllers/Hello.php

    public function loginProcess()
{
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    $adminModel = new AdminModel();
    $admin = $adminModel->where('username', $username)->first();
---
SELECT *
FROM `admins`
WHERE `username` = 'Md_shafik548'
 LIMIT 1