app/Controllers/Home.php

SELECT *
FROM `notices`
ORDER BY `created_at` DESC
 LIMIT 4
SELECT *
FROM `event`
ORDER BY `created_at` DESC
 LIMIT 4
---
    public function index(): string
    {
        //notice
        $noticeModel = new NoticeModel();
         $data['notices'] = $noticeModel->orderBy('created_at', 'DESC')
                                   ->limit(4)
                                   ->find();
        //event
        $eventModel = new EventModel();
        $data['events'] = $eventModel->orderBy('created_at', 'DESC')
                                   ->limit(4)
                                   ->find();