app/Controllers/Notice.php

    public function index(): string
    {
        $noticeModel = new NoticeModel();
        $data['notices'] = $noticeModel->orderBy('created_at', 'DESC')
                                        ->findAll();
        //event
        $eventModel = new EventModel();
        $data['events'] = $eventModel->orderBy('created_at', 'DESC')
                                        ->findAll();
---
SELECT *
FROM `notices`
ORDER BY `created_at` DESC
SELECT *
FROM `event`
ORDER BY `created_at` DESC