app/Controllers/P_dashboard.php

SELECT *
FROM `contact_form`
ORDER BY `id` DESC
SELECT *
FROM `miscellaneous`
ORDER BY `id` DESC
SELECT *
FROM `notices`
ORDER BY `id` DESC
SELECT *
FROM `event`
ORDER BY `id` DESC
SELECT *
FROM `co_curricular`
ORDER BY `id` DESC
---
    public function index()
    {
        if (session()->get('role') === 'superadmin') {
            //contact message
            $model = new ContactFormModel();
            $data['messages'] = $model->orderBy('id', 'DESC')
                                        ->findAll();
        } else {
            $data['messages'] = [];  // empty for normal admin
        }

        if (session()->get('role') === 'superadmin') {
            //miscellaneous
            $model = new MiscellaneousModel();
            $data['records'] = $model->orderBy('id', 'DESC')
                                        ->findAll();
        } else {
            $data['records'] = [];  // empty for normal admin
        }

        //notice
         $noticeModel = new NoticeModel();
        $data['notices'] = $noticeModel->orderBy('id', 'DESC')
                                        ->findAll();
        //event
        $eventModel = new EventModel();
        $data['events'] = $eventModel->orderBy('id', 'DESC')
                                        ->findAll();
        //co-curricular
        $coCurricularModel = new CoCurricularModel();
        $data['medias'] = $coCurricularModel->orderBy('id', 'DESC')
                                        ->findAll();

SELECT *
FROM `toppers`
ORDER BY `stu_percent` DESC
---

        //toppers list / result
        $stdModel = new ToppersModel();
        $data['toppers'] = $stdModel->orderBy('stu_percent', 'DESC')
                                        ->findAll();