app/Controllers/Student.php

SELECT *
FROM `toppers`
ORDER BY `stu_percent` DESC
---
    public function index(): string
    {
        //student corner
        $stdModel = new StudentCornerModel();
        $data['datas'] = $stdModel->orderBy('id', 'DESC')
                                        ->findAll();
        $data['sections'] = $stdModel->findColumn('section');

        //toppers list / result
        $stdModel = new ToppersModel();
        $data['toppers'] = $stdModel->orderBy('stu_percent', 'DESC')
                                        ->findAll();